Revit 2024 API
BuiltInFailures.ScaleFailures.CannotScaleLinkWithSharedCoordinates Property
 Can't scale link that shares coordinates with host model
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotScaleLinkWithSharedCoordinates { get; }
Visual Basic
Public Shared ReadOnly Property CannotScaleLinkWithSharedCoordinates As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotScaleLinkWithSharedCoordinates {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ScaleFailures Class
Autodesk.Revit.DB Namespace